# coding=utf-8
# ***************************************************
# 014 - Работа с файлами
# Gosha Dudar, 2017
# ***************************************************
# Writing sgiman, 2017-2022
# Last Modification, 2025
# ---------------------------------------------------
# 'r' - открыть на чтение
# 'w' - открыть на запись (перезапись)
# 'x' - открыть на запись, если файл не существует
# 'a' - открыть на дозапись
# 'b' - открытие в двоичном виде
# 't' - открыть в текстовом режиме (default)
# '+' - открыть на чтение и запись
#
# f = open('text.txt', 'rt')
# f = open('text.txt', 'rb')

#***************************************************
# OPEN-CLOSE
#***************************************************
print("\n*** 1 ***")

# f = open('text.txt')
#
# print(f.read ())
# print(f.read (4))
# for line in f:
#    print (line)

f = open('text.txt', 'w', encoding='utf-8')
f.write('Hi, it\'s me!\nTest')
f.close()

#***************************************************
# WITH-AS (AUTO CLOSE)
#***************************************************
with open('text2.txt', 'wt', encoding='utf-8') as inFile:   # Открыть файл для записи текста
    words = input('Ввести строку:')                         # Ввод текстовой строки
    inFile.write (words)                                    # Запись в файл с авто-закрытием
