# coding=utf-8
# *******************************************************************
# 020 - Декораторы
# Gosha Dudar, 2017
# *******************************************************************
# Writing sgiman, 2017-2022
# Last Modification, 2025
# -------------------------------------------------------------------
# Декоратор это "обертка" функции до выполнения и после выполнения
#

#-----------------------------------------
# ФУНКЦИЯ ДЕКОРАТОРА (decorator-wrapper)
#-----------------------------------------
def decorator(func):
    def wrapper():
        print("Код до выполнения функции")              # 1
        func()
        print("Код, который сработал после функции")    # 4

    return wrapper


def test(func):
    def wrapper():
        print("Код до выполнения функции 2")            # 2
        func()
        print("Код, который сработал после функции 2")  # 3

    return wrapper


# Двойной декоратор
@decorator
@test
def show():
    print("Я обычная функция")


show()

# dec = decorator (show)
# dec ()
