# coding=utf-8
# ******************************************
# 009 - Кортежи (tuple)
# ******************************************
# Writing sgiman, 2017-2022
# Last Modification, 2025
# ------------------------------------------
# Кортежи - это важные списки, которые нельзя изменять
# Кортежи по размеру памяти меньше списков
#
a = (43, 56, 45.23, 'd')    # КОРТЕЖ
b = [43, 56, 45.23, 'd']    # СПИСОК

# a[0] = 34 # ошибка
b[0] = 34

print (a.__sizeof__())
print (b.__sizeof__())

a = tuple("hello world")        # разделить на символы
print(a)

a = "hello world"               # строка
print(a)

a = ("hello world", "sdf", 345) # кортеж
print(a)
print (a.count(345))            # определить число элементов "345"

# К О Р Т Е Ж И
tp1 = 0,1,2,3,4,5,9,8,7,6,'test','soup','a','b','c'
tp2 = 'hello','world','привет','мир'
print(tp1)
print(tp2)

