# coding=utf-8
# **********************************
# 011 - Множества (set и frozenset)
# Gosha Dudar, 2017
# **********************************
# Writing sgiman, 2017-2022
# Last Modification, 2025
# ----------------------------------
# повторы элементов игнорируются
# a = {} - словарь
# a = [23] - множество
#

print("\n*** 1 ***")
a = set("hello")       # множество (SET) - неупорядоченное
print(type(a))
print(a)

print("\n*** 2 ***")
a = {'23', 32}          # множество {}
print(type(a))
print(a)

print("\n*** 3 ***")
a = {i ** 2 for i in range(10)}    # множество {} - неупорядоченное
al = [i ** 2 for i in range(10)]   # список [] - упорядоченный и индексируемый
print(type(a))
print(a)
print(type(al))
print(al)

print("\n*** frozenset ***")
a = set("Hello")                    # не замороженное множество (изменяется)
b = frozenset("Qwerty")             # запрет для добавления (Замороженное множество!!!)
a.add(1)
print(a)

print("\n*** 4 ***")
a = ['r', 's', 'w', 'a', 's', 'w']  # обычный список
print(a)
print(set (a))                     # вывод множества

print("\n*** 5 ***")
a = {32, 45, 43.23, 76}
print(len(a))
x = 45
print (x in a)              # есть ли 'x' в множестве 'a'

print("\n*** 6 ***")
a = {32, 45, 43.23, 76}
x = {32, 45, 76, 43.23}
print(a.isdisjoint (x))    # если множества 'a' и 'x' не имеет общих элементов - true
print(a == x)

print("\n*** 7 ***")
a = {32, 45, 43.23, 76}
x = {32, 45, 12, 43.23}
a.update (x)                # обновляет множество 'a' с учетом множества 'х' (к 'a' добавляется 12)
print(a)

print ("\n*** 8 ***")
a = {32, 45, 43.23, 76}
x = {32, 45, 12, 43.23}
a.intersection_update (x)   # определить пересечение1 множеств - совпадающие элементы в 'x' и 'a'
print(a)

print("\n*** 9 ***")
a = {32, 45, 43.23, 76}
x = {32, 45, 12, 43.23}
a.difference_update (x)     # определить пересечение2 множеств - элементы которых нет в 'a'
print (a)

print("\n*** 10 ***")
a = {32, 45, 43.23, 76}
x = {32, 45, 12, 43.23}
a.symmetric_difference_update (x)   # определить элементы встречающиеся в одном множестве, но не встречающиеся в обоих
print (a)

print("\n*** 11 ***")
a = {32, 45, 43.23, 76}
x = {32, 45, 12, 43.23}
print('ORIG: ', a)
a.add(23)                   # добавить элемент - "ADD"
print('ADD: ',a)
a.remove(23)                # удалить элемент (если не найден, то error) - "REMOVE"
print('REMOVE: ',a)
a.discard(32)               # удалить элемент (без выдачи ошибки) - "DISCARD"
print('DISCARD: ',a)
a.pop()                     # удалить "случайный" элемент - "POP"
print('POP: ',a)
a.clear()                   # очистить множество - "CLEAR"
print('CLEAR: ',a)
